import { create } from "zustand";
import { assets } from "@/assets/assets";

export const useAppContextBN = create((set) => ({
    eventsbn: [
        {
            id: "001",
            name: "এক কাপ চা",
            description: "'এক কাপ চা' দিয়েই শুরু হয়েছিল আমাদের যাত্রা। চায়ের উষ্ণ আড্ডাকে কেন্দ্র করে একটি ভিন্নধর্মী আয়োজন আমাদের প্রথম অনুষ্ঠানকে জন্ম দিয়েছিল।",
            picture: { src: assets.image_31, alt: "event-1" },
            date: '১৮ ফেব্রুয়ারি ২০২০',
            time: 'বিকাল ৩ টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'

        },
        {
            id: "002",
            name: "উৎসবে বসন্ত",
            description: `শীতের শুষ্কতা কাটিয়ে উষ্ণ রোদ, প্রকৃতি আর জীবনের রঙকে নতুন করে বরণ করতে, টিম উৎসব ১১ মার্চ ২০২২-এ আয়োজন করে “উৎসবে বসন্ত”। এদিন BAU-এর উৎসবপ্রেমী তরুণরা রঙিন পোশাকে বসন্তকে স্বাগত জানায়। প্রাণের এই উৎসবে স্থানীয় কিছু ব্যান্ডও তাদের মনোমুগ্ধকর সুরে সবাইকে মুগ্ধ করে তোলে, যা দিনটিকে করে তোলে আরও আনন্দময় ও উচ্ছ্বাসভরা।`,
            picture: { src: assets.image_44, alt: "event-3" },
            date: '১১ই মার্চ ২০২২',
            time: 'বিকাল ৩ টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "003",
            name: "অনন্ত নক্ষত্রবীথি ও একজন হুমায়ূন",
            description: `এটি ছিল আমাদের আয়োজিত একটি অনলাইন ইভেন্ট, যার লক্ষ্য ছিল হুমায়ূন আহমেদের প্রতি আমাদের ভালোবাসা ও শ্রদ্ধা প্রকাশ করা। আমরা একটি প্রতিযোগিতার আয়োজন করি, যেখানে হুমায়ূন ভক্তরা তাঁদের অনুভূতি সৃজনশীলতার মাধ্যমে প্রকাশ করেছেন। দেশের নানা প্রান্ত থেকে ১,৩০,০০০-এরও বেশি তরুণ অংশগ্রহণ করেন কসপ্লে, ফটোগ্রাফি ও সাহিত্যসহ বিভিন্ন বিভাগে, যা ইভেন্টটিকে করে তোলে সত্যিই অনন্য।`,
            picture: { src: assets.image_43, alt: "event-2" },
            date: '৩১ জুলাই ২০২২',
            time: 'বিকাল ৩ টা ',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "004",
            name: "শ্রাবনের আমন্ত্রণে",
            description: `বর্ষাকালকে স্বাগত জানাতে আমরা আয়োজন করেছিলাম এক বর্ণাঢ্য অনুষ্ঠান। দিনভর চলেছিল গান পরিবেশনা, কবিতা আবৃত্তি, বৃষ্টিকে ঘিরে সৃজনশীল সাজসজ্জা, খিচুড়ি-পাকোড়াসহ নানা মুখরোচক খাবারের আসর এবং আরও অনেক আয়োজন। নারী অংশগ্রহণকারীরা আকাশী নীল শাড়িতে সেজে উঠেছিলেন, যেন প্রকৃতির সজীব রূপের প্রতিচ্ছবি। একই সঙ্গে, আমরা শ্রদ্ধার সঙ্গে স্মরণ করেছি আমাদের বিশ্বকবি রবীন্দ্রনাথ ঠাকুরকে, কারণ দিনটি ছিল তাঁর মৃত্যুবার্ষিকী।`,
            picture: { src: assets.image_49, alt: "event-4" },
            date: '১১ই মার্চ ২০২২',
            time: 'সকাল ৯টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "005",
            name: "নবরূপে নবান্ন",
            description: `“নবরূপে নবান্ন” ছিল আমাদের সবচেয়ে বড় অনুষ্ঠান। যেহেতু আমাদের শিক্ষা কৃষিভিত্তিক, তাই আমরা লক্ষ্য করেছি যে এই নবান্ন অনুষ্ঠানটি বাংলাদেশ কৃষি বিশ্ববিদ্যালয়ের একটি স্বাক্ষর অনুষ্ঠান হিসেবে পরিচিতি পাবে। দুইদিনব্যাপী এই আয়োজনের প্রতিটি মুহূর্তে বিপুল সংখ্যক দর্শক আমাদের সঙ্গে মিলিত হয়ে উদযাপনে অংশগ্রহণ করেছিলেন।`,
            picture: { src: assets.image_46, alt: "event-5" },
            date: '৩ ডিসেম্বর  ২০২২',
            time: 'বিকাল ৩ টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "006",
            name: "১৫ তম আন্তর্জাতিক আন্তঃবিশ্ববিদ্যালয় স্বল্পদৈর্ঘ্য চলচ্চিত্র উৎসব-IIUSFF-ক্যাম্পাস স্ক্রিনিং",
            description: `ঢাকা বিশ্ববিদ্যালয় চলচ্চিত্র সমিতি আয়োজন করেছে এই অনুষ্ঠান, আর টিম উৎসব ছিল সেই স্বপ্নময় মুহূর্তের ক্যাম্পাসের সঙ্গী।`,
            picture: { src: assets.image_37, alt: "event-6" },
            date: '২৬ নভেম্বর ২০২৩',
            time: 'বিকাল ৫:৩০ টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "007",
            name: "আরো এক কাপ চা",
            description: `“আরো এক কাপ চা” আমাদের হৃদয়ের প্রিয় মুহূর্ত। জীবনের ক্লান্তি মুছে দেয় চায়ের এক গরম চুমুকের মতো এই অনুষ্ঠান। এখানে প্রতিটি চুমুকে মিশে থাকে হাসি, গল্প এবং বন্ধুত্বের উষ্ণতা। নানা চায়ের দোকান, মনোমুগ্ধকর পরিবেশ—সব মিলিয়ে এটি হয়ে ওঠে আমাদের জন্য স্বস্তি, আনন্দ ও একরাশ ভালোবাসার প্রতীক।`,
            picture: { src: assets.image_47, alt: "event-7" },
            date: '১৩ ডিসেম্বর  ২০২৩',
            time: 'বিকাল ৪টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "008",
            name: "রোদ্দুর সমাচার",
            description: `হাসি, ভালোবাসা আর স্মৃতিতে ভরা গ্রীষ্মের সোনালী রঙ—রোদ ও ঐক্যের গান, যা টিম উৎসবের হৃদয়ে প্রাণ ঢেলে দিয়েছিল।`,
            picture: { src: assets.image_50, alt: "event-8  " },
            date: '১১ই মার্চ ২০২২',
            time: 'সকাল ৯টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "009",
            name: "নবারুণে নবান্ন ১৪৩১",
            description: `"নবারুণে নবান্ন ১৪৩১" দিয়ে বাংলার হরিৎক্ষেত্রে নবশস্যের নবাঙ্কুরকে স্বাগত জানিয়েছিলো  টিম উৎসব। কৃষক র‍যালি, ক্যামেরায় নবান্ন, তুলিতে নবান্ন, ঐতিহ্যবাহী খাবারের স্টল এবং আরও অনেক আয়োজনে বর্ণিল হয়ে ছিলো পুরোটা দিন। বর্ণে-গন্ধে-ছন্দে-আনন্দে আবারও মনে রাখার মতো একটি দিন কাটিয়েছে বাকৃবির অঙ্গন।`,
            picture: { src: assets.image_51, alt: "event-9  " },
            date: '৯ ডিসেম্বর ২০২৪',
            time: 'সকাল ৯টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "010",
            name: "শুভ নববর্ষ ১৪৩২",
            description: `তীব্র গরমে বাংলার মাটিতে কাল বৈশাখি হাওয়ায় সাথে শুরু হয়ে গেলো বাংলা বর্ষ! তাইতো বাংলা বর্ষকে বরণ করে নিতে টিম উৎসব শামিল হয়েছিল বৈশাখি মঞ্চে।পসরা বসেছিলো পান্তা ভাত,বিভিন্ন ভর্তা সহ হরেক রকম বাঙালিয়ানায়।`,
            picture: { src: assets.image_52, alt: "event-10" },
            date: '৯ ডিসেম্বর ২০২৪',
            time: 'সকাল ৯টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "011",
            name: "উৎসব স্ক্রীনিং",
            description: `"পরিবার ছাড়া দেখা নিষেধ" কী? কথাটা শুনে কী বিশেষ কিছু মনে পড়ে যাচ্ছে নাকি? পরিবারের গল্প, আবেগের রঙ আর সময়ের স্রোতে ভেসে যাওয়া জীবনের কাহিনি নিয়ে যে সিনেমা মাতিয়েছিলো পুরো বাংলাদেশ সেই “উৎসব” এবার আসছে আমাদের ক্যাম্পাসে!`,
            picture: { src: assets.image_53, alt: "event-11" },
            date: '৯ ডিসেম্বর ২০২৪',
            time: 'সকাল ৯টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        },
        {
            id: "012",
            name: "১৬তম ইন্টারন্যাশনাল ইন্টার ইউনিভার্সিটি শর্ট ফিল্ম ফেস্টিভ্যাল – Campus Screening",
            description: `ভালো সিনেমার প্রতি বাকৃবি পরিবারের ভালোবাসা সবসময় আমাদের রোমাঞ্চিত করে। আর সেই আগ্রহকে সম্মান জানাতে ফের সাজছে পর্দা,নতুন আয়োজন নিয়ে হাজির হচ্ছি আমরা! বাকৃবি ক্যাম্পাসে দ্বিতীয়বারের মতো Team Utshob নিয়ে আসছে ১৬তম ইন্টারন্যাশনাল ইন্টার ইউনিভার্সিটি শর্ট ফিল্ম ফেস্টিভ্যাল – Campus Screening`,
            picture: { src: assets.image_54, alt: "event-12" },
            date: '৯ ডিসেম্বর ২০২৪',
            time: 'সকাল ৯টা',
            location: 'বাংলাদেশ কৃষি বিশ্বিদ্যালয়'
        }
    ]
}))